# Install with: brew bundle
# Refresh from current system with: brew bundle dump --force

# Casks land in /Applications
cask_args appdir: "/Applications"

# Shell (oh-my-zsh replaced by antidote + starship)
brew "zsh"
brew "zsh-completions"
brew "zsh-lovers"
brew "antidote"            # plugin manager (autosuggestions, syntax highlighting, OMZ plugins)
brew "starship"           # cross-shell prompt

# Search / navigation
brew "the_silver_searcher"
brew "ctags"
brew "jq"

# Build toolchain
brew "cmake"
brew "ant"
brew "autogen"
brew "automake"
brew "freetype"

# Networking
brew "nmap"

# Git
brew "git"
brew "gh"

# Language/runtime manager (replaces asdf, nvm, rbenv)
brew "mise"

# Cloud
brew "awscli"

# Containers / Linux on macOS
cask "orbstack"

# Shell history sync
brew "atuin"

# 1Password (app + CLI; CLI powers SSH agent + Git signing)
cask "1password"
cask "1password-cli"

# Productivity
cask "alfred"
cask "rectangle"
cask "flux"
cask "finicky"

# Backup / disk
cask "backblaze"
cask "daisydisk"

# Security
cask "little-snitch"

# Editors
cask "zed"
cask "sublime-text"
cask "visual-studio-code"
cask "obsidian"

# Terminal
cask "iterm2"
cask "font-fira-code-nerd-font"   # Nerd Font for starship glyphs

# DB tools
cask "pgadmin4"
cask "querious"

# File transfer / capture
cask "transmit"
cask "licecap"
cask "dropbox"

# Chat
cask "slack"
cask "telegram"
cask "discord"

# Browsers
cask "google-chrome"
cask "brave-browser"
cask "vivaldi"

# Fun
cask "tidal"
